;---------------------------------BEGIN: EMCC\Caliset-----------------------------------------
[CALISET_DLG_102]
CAPTION = программное обеспечение для коррекции HL
ID1022 = набор решений
ID1023 = выберите:
ID1007 = сохранить другой как
ID1017 = удалить
ID1084 = импорт
ID1085 = экспорт

ID1075 = правильный заголовок
ID1024 = основные параметры
ID1025 = диапазон скоростей (мм):
ID1026 = диапазон маркировки (мм):
ID1072 = система координат
ID1077 = угол вращения
ID1079 = x смещение (мм)
ID1080 = y смещение (мм)
ID1119 = зеркало вибрации 1 = x
ID1120 = зеркало вибрации 2 = x
ID1116 = обратный
ID1117 = обратный

ID1030 = коррекция сетки и уровня (двойной щель, чтобы вспять окно автоматического расчета после выбора соотношения Zoom)
ID1009 = Добавить уровень
ID1010 = Уровень удаления
ID1012 = Многоуровневый общий эффект
ID1031 = вернуться к уровню слов:
ID1018 = Текстовый график максимального уровня.

ID1053 = коррекция красного Гуанга
ID1043 = ENABLE
ID1054 = x Коэффициент остелости:
ID1055 = y Zoom Catio:
ID1056 = x смещение (мм):
ID1057 = y отклонение (мм):

ID1058 = фокус
ID1065 = метод фокуса
ID1059 = Динамический тип фокуса
ID1060 = режим управления
ID1061 = расстояние между валом (мм)
ID1082 = Fangtou к высоте рабочей плоскости (мм)
ID1063 = значение -
ID1062 = коэффициент компенсации динамического фокуса

ID1011 = тест f7
ID1037 = остановка
ID1014 = параметр >>

ID1109 = правильный тип
ID1099 = обычная коррекция
ID1100 = высокая коррекция преобразования 1 [сканер]
ID1101 = Коррекция с высокой точки зрения [Импорт реальных данных координат]
ID1110 = Описание высокоточной коррекции: 1, сначала выберите обычную коррекцию для обычной коррекции, предварительно отрегулируйте систему координат, коррекцию красного света, размер и деформацию BOX. 2. Выберите высокоточную коррекцию для создания точки сетки. После получения данных с помощью различных инструментов и их обработки данные импортируются.
ID1114 = Прямой импорт высокоточных корректирующих данных

ID1089 = коррекция высокой рецидивы
ID1086 = генерировать точку сетки
ID1111 = первый шаг: сгенерировать точку сетки.
ID1112 = Шаг 2: Введите реальные данные координат, измеренные с помощью сканера или двух -измерений.
ID1113 = Шаг 3: Создайте таблицу коррекции с высокой оценкой и подтвердите выход для сохранения.

ID1096 = масштабирование
ID1027 = высокий диапазон маркировки (мм)
ID1097 = шишка
ID1028 = размер испытательного окна (мм):
ID1091 = импортные данные после обработки сканера
ID1087 = Данные импорта
ID1016 = создать таблицу коррекции с высокой оценкой
ID1139 = Создать таблицу коррекции 
ID1 = ОК
ID2 = отмена
ID1142 = Контроль маркировки

[CALISET_DLG_167]
CAPTION = Импорт данных с высоким разрешением
ID1114 = x Файл координат, полученный вторым измерением:
ID1115 = y -координат, полученный вторым измерением:
ID1 = ОК
ID2 = отмена

[CALISET_DLG_159]
CAPTION = Сохранить решение
ID1036 = схема исправления хранится отдельно:
ID1 = ОК
ID2 = отмена

[CALISET_DLG_131]
CAPTION = маркировка параметра
ID1032 = количество времен маркировки:
ID1033 = скорость маркировки (мм/с)
ID1035 = Power (%)
ID1034 = q частота (кГц)
ID1036 = время выпуска Q (США)
ID1037 = лазерная задержка турбида (США)
ID1 = ОК
ID2 = отмена

[CALISET_DLG_160]
CAPTION = Установка информации о маркировке метки
ID1093 = количество строк
ID1094 = номер столбца
ID1116 = только установить количество рангов, не отмеченные
ID1 = маркировка
ID2 = отмена
ID1099 = Точка
ID1100 = Крест
ID1101 = Круг

[CALISET_DLG_164]
CAPTION = Выберите карту управления
ID1098 = выберите рабочую карту:
ID1 = ОК
ID2 = отмена

[CALISET_STRINGTABLE]
ID0 = размер коробки (мм)
ID1 = x соотношение Zoom % %
ID2 = y Zoom Catio % %
ID3 = x ухабистый
ID4 = y удара
ID5 = x Trapezoidal
ID6 = y трапециевидная
ID7 = x параллель
ID8 = y параллельно
ID9 = x положительная доля % %
ID10 = x отрицательное соотношение % % %
ID11 = y положительная доля % %
ID12 = y отрицательная доля % %
ID13 = параметр \ Уровень
ID14 = current (a)
ID15 = Power (%)
ID16 = ток (%)
ID17 = ширина лазерного импульса (NS)
ID18 = лазерный режим
ID999 = уже есть программное обеспечение для маркировки или программное обеспечение для коррекции, пожалуйста, закройте его в первую очередь!
ID1000 = потерянный или повреждение файла сравнительного анализа, пожалуйста, подтвердите, является ли программное обеспечение нормальным!
ID1001 = Инициализация карты управления маркировкой не удалась!
ID1002 = Настройки системы управления мечениями не удалось!
ID1003 = выберите уровень коррекции, который вы хотите проверить первым!
ID1004 = Операция не удалась, попробуйте позже!
ID1005 = есть ли имя схемы, которое уже существовало?
ID1006 = область исправления не может быть 0!
ID1007 = область маркировки не может быть 0!
ID1008 = пропорциональный коэффициент масштабы коррекции и масштабы маркировки неверно.
ID1011 = выберите уровень, чтобы удалить уровень
ID1012 = Пожалуйста, сохраните хотя бы первое исправление!
ID1013 = ошибка файла!
ID1014 = Установите данные коррекции на сбой карты, попробуйте позже!
ID1015 = эта схема конфигурации коррекции несовместима с текущей версией программного обеспечения. Является ли он вынужден чтение?
ID1016 = размер коробки не может превышать диапазон маркировки!
ID1017 = размер коробки не может превышать размер предыдущего уровня!
ID1018 = текущие настройки коррекции были изменены, хранится ли он?
ID1019 = Файл чтения не удался!
ID1020 = подтвердить удаление текущей схемы?
ID1021 = программные собаки не обнаружены!
ID1022 = Программные собаки обнаруживаются, но не юридические собаки программного обеспечения!
ID1023 = вставлено более 1 юридического программного обеспечения!
ID1024 = преобразовать начальную собаку в бегущую собаку потерпела неудачу!
ID1025 = «Текущее разрешение на программное обеспечение истек, и вам необходимо связаться с сотрудниками службы обслуживания клиентов, чтобы повторно переоценить для сопоставления счетов лицензии (DOG ID =%S, код проверки =%s)
ID1026 = "D160"
ID1027 = "D480"
ID1028 = "CO2 усиление"
ID1029 = "традиция CO2"
ID1030 = "Запуск не удался"
ID1031 = размер коробки не может быть меньше, чем следующий уровень!
ID1032 = за пределами эффективной области коррекции
ID1033 = "Form Focus"
ID1034 = "3D Dynamic Coking"
ID1035 = "Обычный фокус"
ID1036 = «Простой режим управления лазером должен быть меньше, чем маркировка,%dmm» "
ID1037 = "Получите идентификатор собаки, который хранится в сбой карты, пожалуйста, проверьте, должна ли карта будет связана"
ID1038 = "Импорт сбой"
ID1039 = "Успех импорта"
ID1040 = "Экспорт не удался"
ID1041 = "Экспортный успех"
ID1042 = "Отказ от операции"
ID1043 = "Данные файла не совпадают"
ID1044 = "Focus 3d" потом "
ID1045 = "x Партика координат пуст!"
ID1046 = "y -координатный путь файла пуст!"
ID1047 = "Собака на карте не соответствует зашифрованному номеру собаки"
ID1048 = "номер карты на карте пуст или длина не правильно"

;---------------------------------End: EMCC\Caliset-----------------------------------------

[error]
1 = Карта не инициализирована или карта не найдена!
2 = Сбой сброса!
3 = Версия карты не правильная!
4 = Тревога!
6= Не удалось выполнить задание!
7=Статус не соответствует!
16 = Истекло время ожидания команды!
17=Команда проиграна!
18=Вызов интерфейса асинхронный!
19=Интерфейс занят другой программой!
20 = переполнение оси Z или повреждение файла коррекции!
21=Несоответствие параметров!
23 = Не удалось выделить память!
100 = Автономное использование!
101=Команда прервана!
1001=порт 1
1002=порт 2
1003=порт 3
1004=порт 4
1005=порт 5
1006=порт 6
1007=порт 7
1008 = Лазерный ввод не готов
1009 = Лазерный ввод готов

[4]
1 = перегрев лазера, пожалуйста, выключите питание!
2 = лазерная высокая защита от тревоги, пожалуйста, выключите питание!
3 = Лазер МО ненормальный, пожалуйста, выключите питание!
4 = крышка лазера открыта, выключите питание и установите крышку лазера!
5 = Защитная дверь открыта, пожалуйста, закройте ее!
6 = Затвор закрыт ненормально, выключите питание и проверьте затвор!
7 = Затвор не открыт ненормально, выключите питание и проверьте затвор!
8 = Защитная дверь открыта, маркировка приостановлена, пожалуйста, закройте защитную дверь, чтобы продолжить маркировку!
9 = Защитные ворота открыты, маркировка прервана!
10 = Сигнализация лазерной системы, пожалуйста, выключите питание!
11 = Напряжение питания лазера выходит за пределы допустимого диапазона, пожалуйста, выключите питание!
12 = Сигнализация перенапряжения источника питания лазера, пожалуйста, выключите питание и проверьте мощность лазера!
13 = Сигнал тревоги при пониженном напряжении источника питания лазера, пожалуйста, выключите питание и проверьте мощность лазера!
14 = сигнал тревоги о перегреве лазера SPI, пожалуйста, выключите питание!
15 = сигнал тревоги перегрузки по току усилителя SPI, пожалуйста, выключите питание!
16 = сигнал тревоги перегрузки по току лазерного усилителя мощности SPI, пожалуйста, выключите питание!
17 = сигнал тревоги коллимационного лазера SPI, пожалуйста, выключите питание!
18 = сигнал тревоги удержания лазера SPI, пожалуйста, выключите питание!
19 = сигнал тревоги мощности лазера SPI, пожалуйста, выключите питание!
20 = Лазерная неизвестная сигнализация, пожалуйста, выключите питание!
21 = Сигнализация перегрузки по току лазерной мощности, пожалуйста, выключите питание!
22 = Сигнализация перенапряжения лазерной мощности, пожалуйста, выключите питание!
23 = Сигнализация перегрева мощности лазера, пожалуйста, выключите питание и проверьте условия рассеивания тепла!
24 = Питание лазера не включено, проверьте источник питания.
30= Отрицательный предел встречается во время движения, маркировка прерывается!
31= Когда во время движения встречается положительный предел, маркировка прерывается!
32= Импульс двигателя выходит за пределы допустимого диапазона
33= Гальванометр DA вне диапазона!
34 = Платформа X-ось Супер положительный предел!
35 = превышение отрицательного предела платформы по оси X!
36 = суперположительный предел платформы по оси Y!
37 = сверхотрицательный предел платформы по оси Y!
38 = квадратная головка гальванометра питается ненормально, выключите питание и проверьте!
54=Пожалуйста, переключитесь на таблицу исправлений 512!
55 = Пожалуйста, переключитесь на таблицу коррекции 128!
100 = Защитный ворота действителен и открыт!

110 = достижение отрицательного предела!
111 = достичь положительного предела!
112 = Удар по началу координат в движении!
500 = Гальванометр разогревается, пожалуйста, повторите попытку позже!

[door]
1 = Защитная дверь открыта, пожалуйста, закройте защитную дверь!
2 = Защитная дверь открыта, маркировка приостановлена, пожалуйста, закройте защитную дверь, чтобы продолжить маркировку!
3 = Защитная дверь открыта, маркировка прервана!
4 = Защитная дверь закрыта, можно продолжать отмечать!
5 = Защитная дверь закрыта, и состояние нормальное!
6 = Отрицательный предел встречается во время тренировки, маркировка прерывается!
7 = Положительный предел встречается во время движения, и маркировка прерывается! 

[usb]
1= карта EMCC уже подключена
2=Карта EMCC отключена

[4101]
3 = Информация о функции и версии карты DA 1
4 = информация о дате версии карты DA 1
5 = прошедшее время карты DA 1
7 = количество кадров ошибок для карты DA 1
9 = карта DA 1 обратный отсчет до времени ошибки 4-го бита
11 = время обратного отсчета карты DA 1 для ошибки 3-го бита
13 = карта DA 1 отсчитывает время ошибки 2-го бита
15 = время ошибки последнего бита на карте DA 1

[4102]
4 = Количество кадров вне кода карты DA 1
6 = карта DA 1 отсчитывает время 4-го промаха
8 = карта DA 1 обратный отсчет времени 3-го пропущенного кода
10 = карта DA 1 отсчитывает время второго отсутствующего кода
12 = карта DA 1 последняя пропущена время
14 = карта DA 1 гальванометрическая сигнальная информация
15 = карта DA 1 гальванометр сигнализация выключения лазера

[4103]
3 = функция карты DA 2 и информация о версии
4 = информация о дате версии карты DA 2
5 = прошедшее время карты DA 2
7 = Количество кадров ошибок для карты DA 2
9 = время обратного отсчета карты DA 2 для ошибки 4-го бита
11 = время обратного отсчета карты DA 2 для ошибки 3-го бита
13 = карта DA 2 отсчитывает время ошибки второго бита
15 = время ошибки последнего бита на карте DA 2

[4104]
4 = количество кадров вне кода карты DA 2
6 = карта DA 2 отсчитывает время 4-го промаха
8 = карта DA 2 отсчитывает время третьего промаха
10 = карта DA 2 предпоследнее время потери
12 = время, когда карта DA 2 была пропущена в последний раз
14 = DA карта 2 гальванометрическая информация о тревоге
15 = DA карта 2 гальванометра сигнализация выключения лазера

[4105]
3 = Информация о функции и версии карты LASER
4 = информация о дате версии карты LASER
5 = ПРОШЕДШЕЕ ВРЕМЯ ЛАЗЕРНОЙ КАРТЫ
7 = КОЛИЧЕСТВО КАДРОВ ОШИБОК ДЛЯ ЛАЗЕРНОЙ КАРТЫ
9 = Время предпоследней битовой ошибки карты LASER
11 = Время предпоследней битовой ошибки карты LASER
13 = время обратного отсчета до 2-й битовой ошибки карты LASER
15 = Время ошибки последнего бита на карте LASER

[4106]
4 = КОЛИЧЕСТВО ПРОПУЩЕННЫХ КАДРОВ ЛАЗЕРНОЙ КАРТЫ
6 = Время, когда карта LASER теряет свой код для 4-го обратного отсчета
8 = Время, когда карта LASER теряет код для 3-го обратного отсчета
10 = время, когда карта LASER теряет код во второй предпоследний раз
12 = последний пропущенный код карты LASER
14 = аварийное сообщение LASER гальванометра
15 = лазерная карта, лазерная сигнализация, выключение лазера

[4107]
3 = лазерная карта лазерного тока ns осциллограмма
4 = форма сигнала лазерного тока лазерной карты ps
5 = лазерная карта лазерного тока fs осциллограмма
6 = лазерная карта LASER в настоящее время поддерживает мощность

[4102Warning]
0 = D0: ненормальная передача данных на карте DA 1
1 = D1: карта DA 1 Сигнал тревоги системы сканера
2 = D2: карта DA 1 Сигнал тревоги температуры сканера
3 = D3: карта DA 1 Сигнализация низкой скорости сканера
4 = D4: не используется
5 = D5: не используется
6 = D6: не используется
7 = D7: не используется
8 = D8: не используется
9=D9: не используется
10 = D10: не используется
11=D11: не используется
12 = D12: не используется
13=D13: не используется
14 = D14: не используется
15 = D15: Карта EMCC Ненормальная передача данных

[4104Warning]
0 = D0: ненормальная передача данных на карте DA 2
1 = D1: Сигнал тревоги системы сканера DA Card 2
2 = D2: карта DA 2 Сигнал тревоги температуры сканера
3 = D3: карта DA 2 Низкоскоростная сигнализация сканера
4 = D4: не используется
5 = D5: не используется
6 = D6: не используется
7 = D7: не используется
8 = D8: не используется
9=D9: не используется
10 = D10: не используется
11=D11: не используется
12 = D12: не используется
13=D13: не используется
14 = D14: не используется
15=D15: Не используется

[4106Warning]
0 = D0: ненормальная передача данных с карты LASER
1 = D1: Сигнализатор температуры лазера
2 = D2: Сигнал тревоги питания
3 = D3: Системный сигнал тревоги
4 = D4: высокая защита от тревоги
5 = D5: лазер не готов
6 = D6: Сбой лазерного зажигания
7 = D7: Сигнализатор температуры затравочного лазера
8 = D8: сигнализация перегрузки по току MO
9 = D9: сигнализация перегрузки по току PA
10 = D10: Коллиматорная сигнализация
11 = D11: Удержание сигнала тревоги 5
12 = D12: Удержание сигнала тревоги 4
13 = D13: Удержание сигнала тревоги 3
14 = D14: Удержание сигнала тревоги 2
15 = D15: Удержание сигнала тревоги 1

[Refresh]
Interval = 500
